philips-software/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
#include "hal_st/stm32fxxx/DmaStm.hpp"
#include "hal_st/cortex/InterruptCortex.hpp"
#include "infra/util/ByteRange.hpp"
#include "infra/util/Optional.hpp"

#if !defined(STM32F0) && !defined(STM32F1) && !defined(STM32F3)

namespace hal
{
    namespace
    {
#if defined(DMA_STREAM_BASED)
        const std::array dmaISR{
            std::array{ &DMA1->LISR, &DMA1->LISR, &DMA1->LISR, &DMA1->LISR, &DMA1->HISR, &DMA1->HISR, &DMA1->HISR, &DMA1->HISR },
            std::array{ &DMA2->LISR, &DMA2->LISR, &DMA2->LISR, &DMA2->LISR, &DMA2->HISR, &DMA2->HISR, &DMA2->HISR, &DMA2->HISR },
        };

        const std::array dmaIFCR{
            std::array{ &DMA1->LIFCR, &DMA1->LIFCR, &DMA1->LIFCR, &DMA1->LIFCR, &DMA1->HIFCR, &DMA1->HIFCR, &DMA1->HIFCR, &DMA1->HIFCR },
            std::array{ &DMA2->LIFCR, &DMA2->LIFCR, &DMA2->LIFCR, &DMA2->LIFCR, &DMA2->HIFCR, &DMA2->HIFCR, &DMA2->HIFCR, &DMA2->HIFCR },
        };

        const std::array DmaChannel{
            std::array{ DMA1_Stream0, DMA1_Stream1, DMA1_Stream2, DMA1_Stream3, DMA1_Stream4, DMA1_Stream5, DMA1_Stream6, DMA1_Stream7 },
            std::array{ DMA2_Stream0, DMA2_Stream1, DMA2_Stream2, DMA2_Stream3, DMA2_Stream4, DMA2_Stream5, DMA2_Stream6, DMA2_Stream7 },
        };

        const std::array dmaIrq{
            std::array{ DMA1_Stream0_IRQn, DMA1_Stream1_IRQn, DMA1_Stream2_IRQn, DMA1_Stream3_IRQn, DMA1_Stream4_IRQn, DMA1_Stream5_IRQn, DMA1_Stream6_IRQn, DMA1_Stream7_IRQn },
            std::array{ DMA2_Stream0_IRQn, DMA2_Stream1_IRQn, DMA2_Stream2_IRQn, DMA2_Stream3_IRQn, DMA2_Stream4_IRQn, DMA2_Stream5_IRQn, DMA2_Stream6_IRQn, DMA2_Stream7_IRQn },
        };

        const std::array dmaChannel
        {
            DMA_CHANNEL_0,
                DMA_CHANNEL_1,
                DMA_CHANNEL_2,
                DMA_CHANNEL_3,
                DMA_CHANNEL_4,
                DMA_CHANNEL_5,
                DMA_CHANNEL_6,
                DMA_CHANNEL_7,
#if defined(DMA_CHANNEL_15)
                DMA_CHANNEL_8,
                DMA_CHANNEL_9,
                DMA_CHANNEL_10,
                DMA_CHANNEL_11,
                DMA_CHANNEL_12,
                DMA_CHANNEL_13,
                DMA_CHANNEL_14,
                DMA_CHANNEL_15,
#endif
        };

        const std::array streamToTCIF{ DMA_FLAG_TCIF0_4, DMA_FLAG_TCIF1_5, DMA_FLAG_TCIF2_6, DMA_FLAG_TCIF3_7, DMA_FLAG_TCIF0_4, DMA_FLAG_TCIF1_5, DMA_FLAG_TCIF2_6, DMA_FLAG_TCIF3_7 };
        const std::array streamToHTIF{ DMA_FLAG_HTIF0_4, DMA_FLAG_HTIF1_5, DMA_FLAG_HTIF2_6, DMA_FLAG_HTIF3_7, DMA_FLAG_HTIF0_4, DMA_FLAG_HTIF1_5, DMA_FLAG_HTIF2_6, DMA_FLAG_HTIF3_7 };
        const std::array streamToTEIF{ DMA_FLAG_TEIF0_4, DMA_FLAG_TEIF1_5, DMA_FLAG_TEIF2_6, DMA_FLAG_TEIF3_7, DMA_FLAG_TEIF0_4, DMA_FLAG_TEIF1_5, DMA_FLAG_TEIF2_6, DMA_FLAG_TEIF3_7 };
#endif

#if defined(DMA_CHANNEL_BASED)
        // clang-format off
        const std::array dmaISRDma1
        {
#if defined(GPDMA1_Channel7_NS)
            &GPDMA1_Channel0_NS->CSR,
            &GPDMA1_Channel1_NS->CSR,
            &GPDMA1_Channel2_NS->CSR,
            &GPDMA1_Channel3_NS->CSR,
            &GPDMA1_Channel4_NS->CSR,
            &GPDMA1_Channel5_NS->CSR,
            &GPDMA1_Channel6_NS->CSR,
            &GPDMA1_Channel7_NS->CSR,
#else
            &DMA1->ISR,
            &DMA1->ISR,
            &DMA1->ISR,
            &DMA1->ISR,
            &DMA1->ISR,
            &DMA1->ISR,
#endif
#if defined(DMA1_Channel7)
            &DMA1->ISR,
#endif
#if defined(DMA1_Channel8)
            &DMA1->ISR,
#endif
        };
#if defined(DMA2_Channel1)
        const std::array dmaISRDma2
        {
            &DMA2->ISR,
            &DMA2->ISR,
            &DMA2->ISR,
            &DMA2->ISR,
            &DMA2->ISR,
            &DMA2->ISR,
#if defined(DMA2_Channel7)
            &DMA2->ISR,
#endif
#if defined(DMA2_Channel8)
            &DMA2->ISR,
#endif
        };
#endif


#if defined(DMA2_Channel1)
        const std::array<decltype(dmaISRDma1), 2> dmaISR { dmaISRDma1, dmaISRDma2 };
#else
        const std::array<decltype(dmaISRDma1), 1> dmaISR { dmaISRDma1 };
#endif

        const std::array dmaIFCRDma1
        {
#if defined(GPDMA1_Channel7_NS)
            &GPDMA1_Channel0_NS->CFCR,
            &GPDMA1_Channel1_NS->CFCR,
            &GPDMA1_Channel2_NS->CFCR,
            &GPDMA1_Channel3_NS->CFCR,
            &GPDMA1_Channel4_NS->CFCR,
            &GPDMA1_Channel5_NS->CFCR,
            &GPDMA1_Channel6_NS->CFCR,
            &GPDMA1_Channel7_NS->CFCR,
#else
            &DMA1->IFCR,
            &DMA1->IFCR,
            &DMA1->IFCR,
            &DMA1->IFCR,
            &DMA1->IFCR,
            &DMA1->IFCR,
#endif
#if defined(DMA1_Channel7)
            &DMA1->IFCR,
#endif
#if defined(DMA1_Channel8)
            &DMA1->IFCR,
#endif
        };
#if defined(DMA2_Channel1)
        const std::array dmaIFCRDma2
        {
            &DMA2->IFCR,
            &DMA2->IFCR,
            &DMA2->IFCR,
            &DMA2->IFCR,
            &DMA2->IFCR,
            &DMA2->IFCR,
#if defined(DMA2_Channel7)
            &DMA2->IFCR,
#endif
#if defined(DMA2_Channel8)
            &DMA2->IFCR,
#endif
        };
#endif

#if defined(DMA2_Channel1)
        const std::array<decltype(dmaIFCRDma1), 2> dmaIFCR { dmaIFCRDma1, dmaIFCRDma2 };
#else
        const std::array<decltype(dmaIFCRDma1), 1> dmaIFCR { dmaIFCRDma1 };
#endif

        const std::array DmaChannelDma1
        {
#if defined(GPDMA1_Channel7_NS)
            GPDMA1_Channel0_NS,
            GPDMA1_Channel1_NS,
            GPDMA1_Channel2_NS,
            GPDMA1_Channel3_NS,
            GPDMA1_Channel4_NS,
            GPDMA1_Channel5_NS,
            GPDMA1_Channel6_NS,
            GPDMA1_Channel7_NS,
#else
            DMA1_Channel1,
            DMA1_Channel2,
            DMA1_Channel3,
            DMA1_Channel4,
            DMA1_Channel5,
            DMA1_Channel6,
#endif
#if defined(DMA1_Channel7)
            DMA1_Channel7,
#endif
#if defined(DMA1_Channel8)
            DMA1_Channel8,
#endif
        };
#if defined(DMA2_Channel1)
        const std::array DmaChannelDma2
        {
            DMA2_Channel1,
            DMA2_Channel2,
            DMA2_Channel3,
            DMA2_Channel4,
            DMA2_Channel5,
            DMA2_Channel6,
#if defined(DMA2_Channel7)
            DMA2_Channel7,
#endif
#if defined(DMA2_Channel8)
            DMA2_Channel8,
#endif
        };
#endif

#if defined(DMA2_Channel1)
        const std::array<decltype(DmaChannelDma1), 2> DmaChannel { DmaChannelDma1, DmaChannelDma2 };
#else
        const std::array<decltype(DmaChannelDma1), 1> DmaChannel { DmaChannelDma1 };
#endif

        const std::array dmaIrqDma1
        {
#if defined(GPDMA1)
            GPDMA1_Channel0_IRQn,
            GPDMA1_Channel1_IRQn,
            GPDMA1_Channel2_IRQn,
            GPDMA1_Channel3_IRQn,
            GPDMA1_Channel4_IRQn,
            GPDMA1_Channel5_IRQn,
            GPDMA1_Channel6_IRQn,
            GPDMA1_Channel7_IRQn,
#else
            DMA1_Channel1_IRQn,
            DMA1_Channel2_IRQn,
            DMA1_Channel3_IRQn,
            DMA1_Channel4_IRQn,
            DMA1_Channel5_IRQn,
            DMA1_Channel6_IRQn,
#endif
#if defined(DMA1_Channel7)
            DMA1_Channel7_IRQn,
#endif
#if defined(DMA1_Channel8)
            DMA1_Channel8_IRQn,
#endif
        };
#if defined(DMA2_Channel1)
        const std::array dmaIrqDma2
        {
            DMA2_Channel1_IRQn,
            DMA2_Channel2_IRQn,
            DMA2_Channel3_IRQn,
            DMA2_Channel4_IRQn,
            DMA2_Channel5_IRQn,
            DMA2_Channel6_IRQn,
#if defined(DMA2_Channel7)
            DMA2_Channel7_IRQn,
#endif
#if defined(DMA2_Channel8)
            DMA2_Channel8_IRQn,
#endif
        };
#endif

#if defined(DMA2_Channel1)
        const std::array<decltype(dmaIrqDma1), 2> dmaIrq { dmaIrqDma1, dmaIrqDma2 };
#else
        const std::array<decltype(dmaIrqDma1), 1> dmaIrq { dmaIrqDma1 };
#endif

